Components/TakeCareComponent/TakeCareIntegrationComponent/src/test/resources/testfiles/GetAllTimeTypes/request-input.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:riv:interoperability:headers:1" xmlns:urn1="urn:riv:itintegration:registry:1" xmlns:urn2="urn:riv:crm:scheduling:GetAllTimeTypesResponder:1" xmlns:urn3="urn:riv:crm:scheduling:GetAllTimeTypesResponder:1.1">
   <soapenv:Header>
      <urn:Actor>
         <urn:actorId>188803099368</urn:actorId>
         <urn:actorType>SEUBJECT_OF_CARE</urn:actorType>
      </urn:Actor>
      <urn1:LogicalAddress>LOGICALADDRESS</urn1:LogicalAddress>
   </soapenv:Header>
   <soapenv:Body>
      <urn2:GetAllTimeTypes>
         <urn2:healthcare_facility>HSAVKK123</urn2:healthcare_facility>
         <urn3:careTypeIDs>1</urn3:careTypeIDs>
         <urn3:subject_of_care>188803099368</urn3:subject_of_care>
      </urn2:GetAllTimeTypes>
   </soapenv:Body>
</soapenv:Envelope>